---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FittingParamsCauseGeometryToFailWarning
source: html/de321733-7302-0954-f9b2-379e1bbe21a2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FittingParamsCauseGeometryToFailWarning Property

The one of parameters for the fitting is causing the geometry to fail.

## Syntax (C#)
```csharp
public static FailureDefinitionId FittingParamsCauseGeometryToFailWarning { get; }
```